qmk/ChibiOS/os/hal/ports/STM32/STM32G4xx_TEST/clocktree.h
#define RCC_CCIPR_LPTIM1SEL_PCLK1           ((0U) << 18U)
#define RCC_CCIPR_LPTIM1SEL_LSI             ((1U) << 18U)
#define RCC_CCIPR_LPTIM1SEL_HSI16           ((2U) << 18U)
#define RCC_CCIPR_LPTIM1SEL_LSE             ((3U) << 18U)

#define RCC_CCIPR_SAI1SEL_SYSCLK            ((0U) << 20U)
#define RCC_CCIPR_SAI1SEL_PLLQCLK           ((1U) << 20U)
#define RCC_CCIPR_SAI1SEL_CKIN              ((2U) << 20U)
#define RCC_CCIPR_SAI1SEL_HSI16             ((3U) << 20U)

#define RCC_CCIPR_I2S23SEL_SYSCLK           ((0U) << 22U)
#define RCC_CCIPR_I2S23SEL_PLLQCLK          ((1U) << 22U)
#define RCC_CCIPR_I2S23SEL_CKIN             ((2U) << 22U)
#define RCC_CCIPR_I2S23SEL_HSI16            ((3U) << 22U)

#define RCC_CCIPR_FDCANSEL_HSE              ((0U) << 24U)
#define RCC_CCIPR_FDCANSEL_PLLQCLK          ((1U) << 24U)
#define RCC_CCIPR_FDCANSEL_PCLK1            ((2U) << 24U)

#define RCC_CCIPR_CLK48SEL_HSI48            ((0U) << 26U)
#define RCC_CCIPR_CLK48SEL_PLLQCLK          ((2U) << 26U)

#define RCC_CCIPR_ADC12SEL_NOCLK            ((0U) << 28U)
#define RCC_CCIPR_ADC12SEL_PLLPCLK          ((1U) << 28U)
#define RCC_CCIPR_ADC12SEL_SYSCLK           ((2U) << 28U)

#define RCC_CCIPR_ADC345SEL_NOCLK           ((0U) << 30U)
#define RCC_CCIPR_ADC345SEL_PLLPCLK         ((1U) << 30U)
#define RCC_CCIPR_ADC345SEL_SYSCLK          ((2U) << 30U)

#define RCC_CCIPR2_QSPISEL_SYSCLK           ((0U) << 20U)
#define RCC_CCIPR2_QSPISEL_HSI16            ((1U) << 20U)
#define RCC_CCIPR2_QSPISEL_PLLQCLK          ((2U) << 20U)
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Clock tree configurations
 * @{
 */
/**
 * @brief   Enables dynamic clock handling.
 */
#if !defined(STM32_CFG_CLOCK_DYNAMIC) || defined(__DOXYGEN__)
  #define STM32_CFG_CLOCK_DYNAMIC           FALSE
#endif

/**
 * @brief   Selects the core voltage scaling range.
 */
#if !defined(STM32_CFG_PWR_VOS) || defined(__DOXYGEN__)
  #define STM32_CFG_PWR_VOS                 PWR_CR1_VOS_RANGE1
#endif

/**
 * @brief   Enables the power boost mode.
 */
#if !defined(STM32_CFG_PWR_BOOST) || defined(__DOXYGEN__)
  #define STM32_CFG_PWR_BOOST               TRUE
#endif

/**
 * @brief   Enables the HSI16 clock source.
 */
#if !defined(STM32_CFG_HSI16_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI16_ENABLE            FALSE
#endif

/**
 * @brief   Enables the HSI48 clock source.
 */
#if !defined(STM32_CFG_HSI48_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI48_ENABLE            FALSE
#endif

/**
 * @brief   Enables the HSE clock source.
 */
#if !defined(STM32_CFG_HSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSE_ENABLE              FALSE
#endif

/**
 * @brief   Enables the LSE clock source.
 */
#if !defined(STM32_CFG_LSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSE_ENABLE              FALSE
#endif

/**
 * @brief   Enables the LSI clock source.
 */
#if !defined(STM32_CFG_LSI_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSI_ENABLE              FALSE
#endif

/**
 * @brief   Selects the PLLIN clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - HSI16.
 *          - HSE.
 */
#if !defined(STM32_CFG_PLLIN_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_PLLIN_SEL               RCC_PLLCFGR_PLLSRC_HSI
#endif

/**
 * @brief   Configures the PLLREF clock divider value.
 */
#if !defined(STM32_CFG_PLLREF_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLLREF_VALUE            4
#endif

/**
 * @brief   Configures the PLLVCO clock multiplier value.
 */
#if !defined(STM32_CFG_PLLVCO_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLLVCO_VALUE            84
#endif

/**
 * @brief   Configures the PLLP clock divider value.
 */
#if !defined(STM32_CFG_PLLP_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLLP_VALUE              7
#endif

/**
 * @brief   Configures the PLLQ clock divider value.
 */
#if !defined(STM32_CFG_PLLQ_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLLQ_VALUE              8
#endif

/**
 * @brief   Configures the PLLR clock divider value.
 */
#if !defined(STM32_CFG_PLLR_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PLLR_VALUE              2
#endif

/**
 * @brief   Selects the SYSCLK clock source.
 * @note    Allowed sources:
 *          - HSI16.
 *          - HSE.
 *          - PLLR.
 */
#if !defined(STM32_CFG_SYSCLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSCLK_SEL              RCC_CFGR_SW_PLL
#endif

/**
 * @brief   Configures the HCLK clock divider value.
 */
#if !defined(STM32_CFG_HCLK_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_HCLK_VALUE              1
#endif

/**
 * @brief   Configures the PCLK1 clock divider value.
 */
#if !defined(STM32_CFG_PCLK1_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK1_VALUE             2
#endif

/**
 * @brief   Configures the PCLK2 clock divider value.
 */
#if !defined(STM32_CFG_PCLK2_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK2_VALUE             1
#endif

/**
 * @brief   Selects the MCODIV clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - SYSCLK.
 *          - HSI16.
 *          - HSE.
 *          - PLLR.
 *          - LSI.
 *          - LSE.
 *          - HSI48.
 */
#if !defined(STM32_CFG_MCODIV_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_MCODIV_SEL              RCC_CFGR_MCOSEL_NOCLOCK
#endif

/**
 * @brief   Configures the MCO clock divider value.
 */
#if !defined(STM32_CFG_MCO_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO_VALUE               1
#endif

/**
 * @brief   Selects the LSCO clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSI.
 *          - LSE.
 */
#if !defined(STM32_CFG_LSCO_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LSCO_SEL                RCC_BDCR_LSCOSEL_NOCLOCK
#endif

/**
 * @brief   Selects the RTC clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSE.
 *          - LSI.
 *          - HSEDIV.
 */
#if !defined(STM32_CFG_RTC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RTC_SEL                 RCC_BDCR_RTCSEL_NOCLOCK
#endif

/**
 * @brief   Selects the USART1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_USART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART1_SEL              RCC_CCIPR_USART1SEL_SYSCLK
#endif

/**
 * @brief   Selects the USART2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_USART2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART2_SEL              RCC_CCIPR_USART2SEL_SYSCLK
#endif

/**
 * @brief   Selects the USART3 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_USART3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART3_SEL              RCC_CCIPR_USART3SEL_SYSCLK
#endif

/**
 * @brief   Selects the UART4 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_UART4_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART4_SEL               RCC_CCIPR_UART4SEL_SYSCLK
#endif

/**
 * @brief   Selects the UART5 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_UART5_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART5_SEL               RCC_CCIPR_UART5SEL_SYSCLK
#endif

/**
 * @brief   Selects the LPUART1 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_LPUART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPUART1_SEL             RCC_CCIPR_LPUART1SEL_SYSCLK
#endif

/**
 * @brief   Selects the I2C1 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 */
#if !defined(STM32_CFG_I2C1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C1_SEL                RCC_CCIPR_I2C1SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 */
#if !defined(STM32_CFG_I2C2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C2_SEL                RCC_CCIPR_I2C2SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C3 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 */
#if !defined(STM32_CFG_I2C3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C3_SEL                RCC_CCIPR_I2C3SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C4 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 */
#if !defined(STM32_CFG_I2C4_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C4_SEL                RCC_CCIPR2_I2C4SEL_PCLK1
#endif

/**
 * @brief   Selects the LPTIM1 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - LSI.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_LPTIM1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_SEL              RCC_CCIPR_LPTIM1SEL_PCLK1
#endif

/**
 * @brief   Selects the SAI1 clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - PLLQ.
 *          - CKIN.
 *          - HSI16.
 */
#if !defined(STM32_CFG_SAI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI1_SEL                RCC_CCIPR_SAI1SEL_SYSCLK
#endif

/**
 * @brief   Selects the I2S23 clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - PLLQ.
 *          - CKIN.
 *          - HSI16.
 */
#if !defined(STM32_CFG_I2S23_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2S23_SEL               RCC_CCIPR_I2S23SEL_SYSCLK
#endif

/**
 * @brief   Selects the FDCAN clock source.
 * @note    Allowed sources:
 *          - HSE.
 *          - PLLQ.
 *          - PCLK1.
 */
#if !defined(STM32_CFG_FDCAN_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_FDCAN_SEL               RCC_CCIPR_FDCANSEL_HSE
#endif

/**
 * @brief   Selects the CLK48 clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - PLLQ.
 */
#if !defined(STM32_CFG_CLK48_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_CLK48_SEL               RCC_CCIPR_CLK48SEL_HSI48
#endif

/**
 * @brief   Selects the ADC12 clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - PLLP.
 *          - SYSCLK.
 */
#if !defined(STM32_CFG_ADC12_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADC12_SEL               RCC_CCIPR_ADC12SEL_PLLPCLK
#endif

/**
 * @brief   Selects the ADC345 clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - PLLP.
 *          - SYSCLK.
 */
#if !defined(STM32_CFG_ADC345_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADC345_SEL              RCC_CCIPR_ADC345SEL_PLLPCLK
#endif

/**
 * @brief   Selects the QSPI clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - HSI16.
 *          - PLLQ.
 */
#if !defined(STM32_CFG_QSPI_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_QSPI_SEL                RCC_CCIPR2_QSPISEL_SYSCLK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/**
 * @name    Clock point derived constants and checks
 * @{
 */
/*
 * Extra configuration checks.
 */
#if !defined(TRUE) && !defined(__DOXYGEN__)
  #error "TRUE not defined"
#endif
#if !defined(FALSE) && !defined(__DOXYGEN__)
  #error "FALSE not defined"
#endif
#if !((STM32_CFG_CLOCK_DYNAMIC == TRUE) || (STM32_CFG_CLOCK_DYNAMIC == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_CLOCK_DYNAMIC value specified"
#endif

#if !((STM32_CFG_PWR_VOS == PWR_CR1_VOS_RANGE1) ||                          \
     (STM32_CFG_PWR_VOS == PWR_CR1_VOS_RANGE2)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PWR_VOS value specified"
#endif

#if !((STM32_CFG_PWR_BOOST == TRUE) || (STM32_CFG_PWR_BOOST == FALSE)) &&   \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PWR_BOOST value specified"
#endif

/**
 * @name    Frequency limits for boost state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_BOOST_HSECLK_MIN              8000000
#define STM32_BOOST_HSECLK_MAX              48000000
#else
#define STM32_BOOST_HSECLK_MIN              8000000
#define STM32_BOOST_HSECLK_MAX              48000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_BOOST_LSECLK_MIN              32768
#define STM32_BOOST_LSECLK_MAX              1000000
#else
#define STM32_BOOST_LSECLK_MIN              32768
#define STM32_BOOST_LSECLK_MAX              32768
#endif
#define STM32_BOOST_PLLIN_MIN               2660000
#define STM32_BOOST_PLLIN_MAX               16000000
#define STM32_BOOST_PLLVCO_MIN              96000000
#define STM32_BOOST_PLLVCO_MAX              344000000
#define STM32_BOOST_PLLP_MIN                2064500
#define STM32_BOOST_PLLP_MAX                170000000
#define STM32_BOOST_PLLQ_MIN                8000000
#define STM32_BOOST_PLLQ_MAX                170000000
#define STM32_BOOST_PLLR_MIN                8000000
#define STM32_BOOST_PLLR_MAX                170000000
#define STM32_BOOST_SYSCLK_MAX              170000000
#define STM32_BOOST_HCLK_MAX                170000000
#define STM32_BOOST_PCLK1_MAX               170000000
#define STM32_BOOST_PCLK2_MAX               170000000
#define STM32_BOOST_ADCCLK_MAX              60000000
#define STM32_BOOST_FLASH_0WS_MAX           34000000
#define STM32_BOOST_FLASH_1WS_MAX           68000000
#define STM32_BOOST_FLASH_2WS_MAX           102000000
#define STM32_BOOST_FLASH_3WS_MAX           136000000
#define STM32_BOOST_FLASH_4WS_MAX           170000000
/** @} */

/**
 * @name    Frequency limits for vos1 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_HSECLK_MIN               8000000
#define STM32_VOS1_HSECLK_MAX               48000000
#else
#define STM32_VOS1_HSECLK_MIN               8000000
#define STM32_VOS1_HSECLK_MAX               48000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_LSECLK_MIN               32768
#define STM32_VOS1_LSECLK_MAX               1000000
#else
#define STM32_VOS1_LSECLK_MIN               32768
#define STM32_VOS1_LSECLK_MAX               32768
#endif
#define STM32_VOS1_PLLIN_MIN                2660000
#define STM32_VOS1_PLLIN_MAX                16000000
#define STM32_VOS1_PLLVCO_MIN               96000000
#define STM32_VOS1_PLLVCO_MAX               344000000
#define STM32_VOS1_PLLP_MIN                 2064500
#define STM32_VOS1_PLLP_MAX                 150000000
#define STM32_VOS1_PLLQ_MIN                 8000000
#define STM32_VOS1_PLLQ_MAX                 150000000
#define STM32_VOS1_PLLR_MIN                 8000000
#define STM32_VOS1_PLLR_MAX                 150000000
#define STM32_VOS1_SYSCLK_MAX               150000000
#define STM32_VOS1_HCLK_MAX                 150000000
#define STM32_VOS1_PCLK1_MAX                150000000
#define STM32_VOS1_PCLK2_MAX                150000000
#define STM32_VOS1_ADCCLK_MAX               60000000
#define STM32_VOS1_FLASH_0WS_MAX            30000000
#define STM32_VOS1_FLASH_1WS_MAX            60000000
#define STM32_VOS1_FLASH_2WS_MAX            90000000
#define STM32_VOS1_FLASH_3WS_MAX            120000000
#define STM32_VOS1_FLASH_4WS_MAX            150000000
/** @} */

/**
 * @name    Frequency limits for vos2 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_HSECLK_MIN               8000000
#define STM32_VOS2_HSECLK_MAX               26000000
#else
#define STM32_VOS2_HSECLK_MIN               8000000
#define STM32_VOS2_HSECLK_MAX               26000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_LSECLK_MIN               32768
#define STM32_VOS2_LSECLK_MAX               1000000
#else
#define STM32_VOS2_LSECLK_MIN               32768
#define STM32_VOS2_LSECLK_MAX               32768
#endif
#define STM32_VOS2_PLLIN_MIN                2660000
#define STM32_VOS2_PLLIN_MAX                16000000
#define STM32_VOS2_PLLVCO_MIN               96000000
#define STM32_VOS2_PLLVCO_MAX               128000000
#define STM32_VOS2_PLLP_MIN                 2064500
#define STM32_VOS2_PLLP_MAX                 26000000
#define STM32_VOS2_PLLQ_MIN                 8000000
#define STM32_VOS2_PLLQ_MAX                 26000000
#define STM32_VOS2_PLLR_MIN                 8000000
#define STM32_VOS2_PLLR_MAX                 26000000
#define STM32_VOS2_SYSCLK_MAX               26000000
#define STM32_VOS2_HCLK_MAX                 26000000
#define STM32_VOS2_PCLK1_MAX                26000000
#define STM32_VOS2_PCLK2_MAX                26000000
#define STM32_VOS2_ADCCLK_MAX               26000000
#define STM32_VOS2_FLASH_0WS_MAX            12000000
#define STM32_VOS2_FLASH_1WS_MAX            24000000
#define STM32_VOS2_FLASH_2WS_MAX            26000000
#define STM32_VOS2_FLASH_3WS_MAX            0
#define STM32_VOS2_FLASH_4WS_MAX            0
/** @} */

