qmk/ChibiOS/os/hal/ports/STM32/STM32G4xx_TEST/clocktree.h
/*
 * Selected frequency limits.
 */
#if ((STM32_CFG_PWR_VOS == PWR_CR1_VOS_RANGE1) && \
     (STM32_CFG_PWR_BOOST == TRUE)) || \
    defined(__DOXYGEN__)
#define STM32_HSECLK_MIN                    STM32_BOOST_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_BOOST_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_BOOST_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_BOOST_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_BOOST_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_BOOST_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_BOOST_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_BOOST_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_BOOST_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_BOOST_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_BOOST_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_BOOST_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_BOOST_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_BOOST_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_BOOST_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_BOOST_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_BOOST_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_BOOST_PCLK2_MAX
#define STM32_ADCCLK_MAX                    STM32_BOOST_ADCCLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_BOOST_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_BOOST_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_BOOST_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_BOOST_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_BOOST_FLASH_4WS_MAX
#elif (STM32_CFG_PWR_VOS == PWR_CR1_VOS_RANGE1)
#define STM32_HSECLK_MIN                    STM32_VOS1_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS1_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS1_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS1_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS1_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS1_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS1_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS1_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS1_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS1_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS1_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS1_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS1_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS1_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS1_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS1_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS1_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS1_PCLK2_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS1_ADCCLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS1_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS1_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS1_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS1_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS1_FLASH_4WS_MAX
#elif (STM32_CFG_PWR_VOS == PWR_CR1_VOS_RANGE2)
#define STM32_HSECLK_MIN                    STM32_VOS2_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS2_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS2_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS2_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS2_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS2_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS2_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS2_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS2_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS2_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS2_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS2_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS2_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS2_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS2_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS2_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS2_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS2_PCLK2_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS2_ADCCLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS2_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS2_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS2_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS2_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS2_FLASH_4WS_MAX
#else
  #error "unable to select clock frequency limits"
#endif

/**
 * @name    Sink demand states
 * @{
 */
/**
 * @brief   RTC sink demand state.
 */
#if (HAL_USE_RTC == TRUE) || defined(__DOXYGEN__)
  #define STM32_RTC_DEMANDED                TRUE
#else
  #define STM32_RTC_DEMANDED                FALSE
#endif
/** @} */

/**
 * @brief   NONE clock derived enable state.
 */
#define STM32_NONE_ENABLED                  FALSE

/**
 * @brief   HSI16 clock derived enable state.
 */
#define STM32_HSI16_ENABLED                 STM32_CFG_HSI16_ENABLE

/**
 * @brief   HSI48 clock derived enable state.
 */
#define STM32_HSI48_ENABLED                 STM32_CFG_HSI48_ENABLE

/**
 * @brief   HSE clock derived enable state.
 */
#define STM32_HSE_ENABLED                   STM32_CFG_HSE_ENABLE

/**
 * @brief   LSE clock derived enable state.
 */
#define STM32_LSE_ENABLED                   STM32_CFG_LSE_ENABLE

/**
 * @brief   LSI clock derived enable state.
 */
#define STM32_LSI_ENABLED                   STM32_CFG_LSI_ENABLE

/**
 * @brief   CKIN clock derived enable state.
 */
#define STM32_CKIN_ENABLED                  TRUE

/**
 * @brief   PLLIN clock derived enable state.
 */
#define STM32_PLLIN_ENABLED                 ((STM32_PLLREF_ENABLED == TRUE))

/**
 * @brief   PLLREF clock derived enable state.
 */
#define STM32_PLLREF_ENABLED                ((STM32_PLLVCO_ENABLED == TRUE))

/**
 * @brief   PLLVCO clock derived enable state.
 */
#define STM32_PLLVCO_ENABLED                ((STM32_PLLP_ENABLED == TRUE) || \
                                             (STM32_PLLQ_ENABLED == TRUE) || \
                                             (STM32_PLLR_ENABLED == TRUE))

/**
 * @brief   PLLP clock derived enable state.
 */
#define STM32_PLLP_ENABLED                  (((STM32_ADC12_ENABLED == TRUE) && \
                                              (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_PLLPCLK)) || \
                                             ((STM32_ADC345_ENABLED == TRUE) && \
                                              (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_PLLPCLK)))

/**
 * @brief   PLLQ clock derived enable state.
 */
#define STM32_PLLQ_ENABLED                  (((STM32_SAI1_ENABLED == TRUE) && \
                                              (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_PLLQCLK)) || \
                                             ((STM32_I2S23_ENABLED == TRUE) && \
                                              (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_PLLQCLK)) || \
                                             ((STM32_FDCAN_ENABLED == TRUE) && \
                                              (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_PLLQCLK)) || \
                                             ((STM32_CLK48_ENABLED == TRUE) && \
                                              (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_PLLQCLK)) || \
                                             ((STM32_QSPI_ENABLED == TRUE) && \
                                              (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_PLLQCLK)))

/**
 * @brief   PLLR clock derived enable state.
 */
#define STM32_PLLR_ENABLED                  (((STM32_SYSCLK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_PLL)) || \
                                             ((STM32_MCODIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_PLLRCLK)))

/**
 * @brief   SYSCLK clock derived enable state.
 */
#define STM32_SYSCLK_ENABLED                TRUE

/**
 * @brief   HCLK clock derived enable state.
 */
#define STM32_HCLK_ENABLED                  TRUE

/**
 * @brief   PCLK1 clock derived enable state.
 */
#define STM32_PCLK1_ENABLED                 TRUE

/**
 * @brief   PCLK2 clock derived enable state.
 */
#define STM32_PCLK2_ENABLED                 TRUE

/**
 * @brief   PCLK1TIM clock derived enable state.
 */
#define STM32_PCLK1TIM_ENABLED              TRUE

/**
 * @brief   PCLK2TIM clock derived enable state.
 */
#define STM32_PCLK2TIM_ENABLED              TRUE

/**
 * @brief   HSEDIV clock derived enable state.
 */
#define STM32_HSEDIV_ENABLED                (((STM32_RTC_ENABLED == TRUE) && \
                                              (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)))

/**
 * @brief   MCODIV clock derived enable state.
 */
#define STM32_MCODIV_ENABLED                TRUE

/**
 * @brief   MCO clock derived enable state.
 */
#define STM32_MCO_ENABLED                   TRUE

/**
 * @brief   LSCO clock derived enable state.
 */
#define STM32_LSCO_ENABLED                  TRUE

/**
 * @brief   RTC clock derived enable state.
 */
#define STM32_RTC_ENABLED                   ((STM32_RTC_DEMANDED == TRUE))

/**
 * @brief   USART1 clock derived enable state.
 */
#define STM32_USART1_ENABLED                TRUE

/**
 * @brief   USART2 clock derived enable state.
 */
#define STM32_USART2_ENABLED                TRUE

/**
 * @brief   USART3 clock derived enable state.
 */
#define STM32_USART3_ENABLED                TRUE

/**
 * @brief   UART4 clock derived enable state.
 */
#define STM32_UART4_ENABLED                 TRUE

/**
 * @brief   UART5 clock derived enable state.
 */
#define STM32_UART5_ENABLED                 TRUE

/**
 * @brief   LPUART1 clock derived enable state.
 */
#define STM32_LPUART1_ENABLED               TRUE

/**
 * @brief   I2C1 clock derived enable state.
 */
#define STM32_I2C1_ENABLED                  TRUE

/**
 * @brief   I2C2 clock derived enable state.
 */
#define STM32_I2C2_ENABLED                  TRUE

/**
 * @brief   I2C3 clock derived enable state.
 */
#define STM32_I2C3_ENABLED                  TRUE

/**
 * @brief   I2C4 clock derived enable state.
 */
#define STM32_I2C4_ENABLED                  TRUE

/**
 * @brief   LPTIM1 clock derived enable state.
 */
#define STM32_LPTIM1_ENABLED                TRUE

/**
 * @brief   SAI1 clock derived enable state.
 */
#define STM32_SAI1_ENABLED                  TRUE

/**
 * @brief   I2S23 clock derived enable state.
 */
#define STM32_I2S23_ENABLED                 TRUE

/**
 * @brief   FDCAN clock derived enable state.
 */
#define STM32_FDCAN_ENABLED                 TRUE

/**
 * @brief   CLK48 clock derived enable state.
 */
#define STM32_CLK48_ENABLED                 TRUE

/**
 * @brief   ADC12 clock derived enable state.
 */
#define STM32_ADC12_ENABLED                 TRUE

/**
 * @brief   ADC345 clock derived enable state.
 */
#define STM32_ADC345_ENABLED                TRUE

/**
 * @brief   QSPI clock derived enable state.
 */
#define STM32_QSPI_ENABLED                  TRUE

/**
 * @brief   RNG clock derived enable state.
 */
#define STM32_RNG_ENABLED                   TRUE

/**
 * @brief   USB clock derived enable state.
 */
#define STM32_USB_ENABLED                   TRUE

/*--- Macros and checks for the NONE clock point. --------------------------*/

/**
 * @brief   NONE nominal source frequency.
 */
#define STM32_NONE_SOURCE_FREQ              0U

/**
 * @brief   NONE clock register bits.
 */
#define STM32_NONE_BITS                     0U

/**
 * @brief   Pseudo-clock for disabled sources clock point.
 */
#define STM32_NONE_FREQ                     0U

/*--- Macros and checks for the HSI16 clock point. -------------------------*/

