qmk/ChibiOS/os/hal/ports/STM32/STM32G4xx_TEST/clocktree.h
#if !((STM32_CFG_HSI16_ENABLE == TRUE) || (STM32_CFG_HSI16_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSI16_ENABLE value specified"
#endif

#if !defined(RCC_PLLCFGR_PLLSRC_HSI) && !defined(__DOXYGEN__)
  #error "RCC_PLLCFGR_PLLSRC_HSI not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_PLLIN_ENABLED == TRUE) &&   \
      (STM32_CFG_PLLIN_SEL == RCC_PLLCFGR_PLLSRC_HSI))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by PLLIN"
#endif

#if !defined(RCC_CFGR_SW_HSI) && !defined(__DOXYGEN__)
  #error "RCC_CFGR_SW_HSI not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SYSCLK_ENABLED == TRUE) &&  \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_HSI))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SYSCLK"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_MCODIV_ENABLED == TRUE) &&  \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by MCODIV"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART1_ENABLED == TRUE) &&  \
      (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_HSI16))) &&              \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART2_ENABLED == TRUE) &&  \
      (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_HSI16))) &&              \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART2"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_USART3_ENABLED == TRUE) &&  \
      (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_HSI16))) &&              \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by USART3"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_UART4_ENABLED == TRUE) &&   \
      (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by UART4"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_UART5_ENABLED == TRUE) &&   \
      (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by UART5"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPUART1_ENABLED == TRUE) && \
      (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_HSI16))) &&            \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPUART1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C1_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C1_SEL == RCC_CCIPR_I2C1SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C2_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR_I2C2SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C2"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C3_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR_I2C3SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C3"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C4_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C4_SEL == RCC_CCIPR2_I2C4SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C4"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPTIM1_ENABLED == TRUE) &&  \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_HSI16))) &&              \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPTIM1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SAI1_ENABLED == TRUE) &&    \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SAI1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2S23_ENABLED == TRUE) &&   \
      (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2S23"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_QSPI_ENABLED == TRUE) &&    \
      (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by QSPI"
#endif

/**
 * @brief   HSI16 nominal source frequency.
 */
#define STM32_HSI16_SOURCE_FREQ             16000000U

/**
 * @brief   HSI16 clock register bits.
 */
#if (STM32_HSI16_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI16_BITS                  (RCC_CR_HSIKERON | RCC_CR_HSION)
#else
  #define STM32_HSI16_BITS                  0U
#endif

/**
 * @brief   16MHz high speed internal oscillator clock point.
 */
#if (STM32_HSI16_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI16_FREQ                  STM32_HSI16_SOURCE_FREQ
#else
  #define STM32_HSI16_FREQ                  0U
#endif

/*--- Macros and checks for the HSI48 clock point. -------------------------*/

#if !((STM32_CFG_HSI48_ENABLE == TRUE) || (STM32_CFG_HSI48_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSI48_ENABLE value specified"
#endif

#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_MCODIV_ENABLED == TRUE) &&  \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI48))) && !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by MCODIV"
#endif

#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_CLK48_ENABLED == TRUE) &&   \
      (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_HSI48))) && !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by CLK48"
#endif

/**
 * @brief   HSI48 nominal source frequency.
 */
#define STM32_HSI48_SOURCE_FREQ             48000000U

/**
 * @brief   HSI48 clock register bits.
 */
#if (STM32_HSI48_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI48_BITS                  RCC_CRRCR_HSI48ON
#else
  #define STM32_HSI48_BITS                  0U
#endif

/**
 * @brief   48MHz high speed internal oscillator clock point.
 */
#if (STM32_HSI48_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI48_FREQ                  STM32_HSI48_SOURCE_FREQ
#else
  #define STM32_HSI48_FREQ                  0U
#endif

/*--- Macros and checks for the HSE clock point. ---------------------------*/

#if !((STM32_CFG_HSE_ENABLE == TRUE) || (STM32_CFG_HSE_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSE_ENABLE value specified"
#endif

#if !defined(RCC_PLLCFGR_PLLSRC_HSE) && !defined(__DOXYGEN__)
  #error "RCC_PLLCFGR_PLLSRC_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_PLLIN_ENABLED == TRUE) &&     \
      (STM32_CFG_PLLIN_SEL == RCC_PLLCFGR_PLLSRC_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by PLLIN"
#endif

#if !defined(RCC_CFGR_SW_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR_SW_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_SYSCLK_ENABLED == TRUE) &&    \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by SYSCLK"
#endif

#if !defined(STM32_HSEDIV_ENABLED) && !defined(__DOXYGEN__)
  #error "STM32_HSEDIV_ENABLED not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_HSEDIV_ENABLED == TRUE))) &&  \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by HSEDIV"
#endif

#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_MCODIV_ENABLED == TRUE) &&    \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by MCODIV"
#endif

#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_FDCAN_ENABLED == TRUE) &&     \
      (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by FDCAN"
#endif

/**
 * @brief   HSE nominal source frequency.
 */
#define STM32_HSE_SOURCE_FREQ               STM32_HSECLK

/**
 * @brief   HSE clock register bits.
 */
#if (STM32_HSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSE_BITS                    RCC_CR_HSEON
#else
  #define STM32_HSE_BITS                    0U
#endif

/**
 * @brief   High frequency external oscillator clock point.
 */
#if (STM32_HSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSE_FREQ                    STM32_HSE_SOURCE_FREQ
#else
  #define STM32_HSE_FREQ                    0U
#endif

#if !((STM32_HSE_ENABLED != TRUE) || (STM32_HSE_FREQ >= STM32_HSECLK_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_HSE_FREQ below minimum frequency"
#endif

