qmk/ChibiOS/os/hal/ports/STM32/STM32G4xx_TEST/clocktree.h
#if !defined(RCC_CFGR_SW_PLL) && !defined(__DOXYGEN__)
  #error "RCC_CFGR_SW_PLL not defined"
#endif
#if !(!((STM32_SYSCLK_ENABLED == TRUE) &&                                   \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR_SW_PLL)) ||                         \
     (STM32_PLLR_FREQ <= STM32_SYSCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SYSCLK_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the HCLK clock point. --------------------------*/

/**
 * @brief   HCLK clock register bits.
 */
#if (STM32_CFG_HCLK_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV1
#elif (STM32_CFG_HCLK_VALUE == 2)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV2
#elif (STM32_CFG_HCLK_VALUE == 4)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV4
#elif (STM32_CFG_HCLK_VALUE == 8)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV8
#elif (STM32_CFG_HCLK_VALUE == 16)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV16
#elif (STM32_CFG_HCLK_VALUE == 64)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV64
#elif (STM32_CFG_HCLK_VALUE == 128)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV128
#elif (STM32_CFG_HCLK_VALUE == 256)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV256
#elif (STM32_CFG_HCLK_VALUE == 512)
  #define STM32_HCLK_BITS                   RCC_CFGR_HPRE_DIV512
#else
  #error "invalid STM32_CFG_HCLK_VALUE value specified"
#endif

/**
 * @brief   AHB clock point.
 */
#define STM32_HCLK_FREQ                     (STM32_SYSCLK_FREQ /            \
                                             STM32_CFG_HCLK_VALUE)

#if !((STM32_HCLK_ENABLED != TRUE) || (STM32_HCLK_FREQ <= STM32_HCLK_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_HCLK_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the PCLK1 clock point. -------------------------*/

/**
 * @brief   PCLK1 clock register bits.
 */
#if (STM32_CFG_PCLK1_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV1
#elif (STM32_CFG_PCLK1_VALUE == 2)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV2
#elif (STM32_CFG_PCLK1_VALUE == 4)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV4
#elif (STM32_CFG_PCLK1_VALUE == 8)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV8
#elif (STM32_CFG_PCLK1_VALUE == 16)
  #define STM32_PCLK1_BITS                  RCC_CFGR_PPRE1_DIV16
#else
  #error "invalid STM32_CFG_PCLK1_VALUE value specified"
#endif

/**
 * @brief   APB1 clock point.
 */
#define STM32_PCLK1_FREQ                    (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK1_VALUE)

#if !((STM32_PCLK1_ENABLED != TRUE) || (STM32_PCLK1_FREQ <= STM32_PCLK1_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK1_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the PCLK2 clock point. -------------------------*/

/**
 * @brief   PCLK2 clock register bits.
 */
#if (STM32_CFG_PCLK2_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV1
#elif (STM32_CFG_PCLK2_VALUE == 2)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV2
#elif (STM32_CFG_PCLK2_VALUE == 4)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV4
#elif (STM32_CFG_PCLK2_VALUE == 8)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV8
#elif (STM32_CFG_PCLK2_VALUE == 16)
  #define STM32_PCLK2_BITS                  RCC_CFGR_PPRE2_DIV16
#else
  #error "invalid STM32_CFG_PCLK2_VALUE value specified"
#endif

/**
 * @brief   APB2 clock point.
 */
#define STM32_PCLK2_FREQ                    (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK2_VALUE)

#if !((STM32_PCLK2_ENABLED != TRUE) || (STM32_PCLK2_FREQ <= STM32_PCLK2_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK2_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the PCLK1TIM clock point. ----------------------*/

/**
 * @brief   PCLK1TIM clock register bits.
 */
#define STM32_PCLK1TIM_BITS                 0U

/**
 * @brief   APB1 timer clock point.
 */
#define STM32_PCLK1TIM_FREQ                 ((STM32_CFG_PCLK1_VALUE == 1) ? STM32_PCLK1_FREQ : \
                                             (STM32_PCLK1_FREQ * 2U))

/*--- Macros and checks for the PCLK2TIM clock point. ----------------------*/

/**
 * @brief   PCLK2TIM clock register bits.
 */
#define STM32_PCLK2TIM_BITS                 0U

/**
 * @brief   APB2 timer clock point.
 */
#define STM32_PCLK2TIM_FREQ                 ((STM32_CFG_PCLK2_VALUE == 1) ? STM32_PCLK2_FREQ : \
                                             (STM32_PCLK2_FREQ * 2U))

/*--- Macros and checks for the HSEDIV clock point. ------------------------*/

/**
 * @brief   HSEDIV clock register bits.
 */
#define STM32_HSEDIV_BITS                   0U

/**
 * @brief   HSE divided-by-32 RTC clock point.
 */
#if (STM32_HSEDIV_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSEDIV_FREQ                 (STM32_HSE_FREQ / 32U)
#else
  #define STM32_HSEDIV_FREQ                 0U
#endif

/*--- Macros and checks for the MCODIV clock point. ------------------------*/

/**
 * @brief   MCODIV clock register bits.
 */
#if (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_NOCLOCK
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_SYSCLK)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_SYSCLK
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI16)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_HSI16
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSE)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_HSE
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_PLLRCLK)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_PLLRCLK
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSI)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_LSI
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSE)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_LSE
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI48)
  #define STM32_MCODIV_BITS                 RCC_CFGR_MCOSEL_HSI48
#else
  #error "invalid STM32_CFG_MCODIV_SEL value specified"
#endif

/**
 * @brief   MCO source before prescaler clock point.
 */
#if ((STM32_MCODIV_ENABLED == TRUE) && \
     (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_MCODIV_FREQ                 STM32_NONE_FREQ
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_SYSCLK)
  #define STM32_MCODIV_FREQ                 STM32_SYSCLK_FREQ
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI16)
  #define STM32_MCODIV_FREQ                 STM32_HSI16_FREQ
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSE)
  #define STM32_MCODIV_FREQ                 STM32_HSE_FREQ
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_PLLRCLK)
  #define STM32_MCODIV_FREQ                 STM32_PLLR_FREQ
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSI)
  #define STM32_MCODIV_FREQ                 STM32_LSI_FREQ
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_LSE)
  #define STM32_MCODIV_FREQ                 STM32_LSE_FREQ
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR_MCOSEL_HSI48)
  #define STM32_MCODIV_FREQ                 STM32_HSI48_FREQ
#else
  #define STM32_MCODIV_FREQ                 0U
#endif

/*--- Macros and checks for the MCO clock point. ---------------------------*/

/**
 * @brief   MCO clock register bits.
 */
#if (STM32_CFG_MCO_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV1
#elif (STM32_CFG_MCO_VALUE == 2)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV2
#elif (STM32_CFG_MCO_VALUE == 4)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV4
#elif (STM32_CFG_MCO_VALUE == 8)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV8
#elif (STM32_CFG_MCO_VALUE == 16)
  #define STM32_MCO_BITS                    RCC_CFGR_MCOPRE_DIV16
#else
  #error "invalid STM32_CFG_MCO_VALUE value specified"
#endif

/**
 * @brief   MCO output pin clock point.
 */
#define STM32_MCO_FREQ                      (STM32_MCODIV_FREQ /            \
                                             STM32_CFG_MCO_VALUE)

/*--- Macros and checks for the LSCO clock point. --------------------------*/

/**
 * @brief   LSCO clock register bits.
 */
#if (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_NOCLOCK
#elif (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSI)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_LSI
#elif (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_LSE
#else
  #error "invalid STM32_CFG_LSCO_SEL value specified"
#endif

/**
 * @brief   LSCO output pin clock point.
 */
#if ((STM32_LSCO_ENABLED == TRUE) && \
     (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_LSCO_FREQ                   STM32_NONE_FREQ
#elif (STM32_LSCO_ENABLED == TRUE) && \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSI)
  #define STM32_LSCO_FREQ                   STM32_LSI_FREQ
#elif (STM32_LSCO_ENABLED == TRUE) && \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE)
  #define STM32_LSCO_FREQ                   STM32_LSE_FREQ
#else
  #define STM32_LSCO_FREQ                   0U
#endif

/*--- Macros and checks for the RTC clock point. ---------------------------*/

/**
 * @brief   RTC clock register bits.
 */
#if (STM32_RTC_ENABLED == FALSE)
  #define STM32_RTC_BITS                    RCC_BDCR_RTCSEL_NOCLOCK
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_NOCLOCK) || defined(__DOXYGEN__)
  #if (STM32_RTC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RTC_BITS                  RCC_BDCR_RTCSEL_NOCLOCK
  #else
    #define STM32_RTC_BITS                  0U
  #endif
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSE)
  #if (STM32_RTC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RTC_BITS                  RCC_BDCR_RTCSEL_LSE
  #else
    #define STM32_RTC_BITS                  0U
  #endif
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSI)
  #if (STM32_RTC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RTC_BITS                  RCC_BDCR_RTCSEL_LSI
  #else
    #define STM32_RTC_BITS                  0U
  #endif
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)
  #if (STM32_RTC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RTC_BITS                  RCC_BDCR_RTCSEL_HSEDIV
  #else
    #define STM32_RTC_BITS                  0U
  #endif
#else
  #error "invalid STM32_CFG_RTC_SEL value specified"
#endif

/**
 * @brief   RTC clock point.
 */
#if ((STM32_RTC_ENABLED == TRUE) && \
     (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_RTC_FREQ                    STM32_NONE_FREQ
#elif (STM32_RTC_ENABLED == TRUE) && \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSE)
  #define STM32_RTC_FREQ                    STM32_LSE_FREQ
#elif (STM32_RTC_ENABLED == TRUE) && \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSI)
  #define STM32_RTC_FREQ                    STM32_LSI_FREQ
#elif (STM32_RTC_ENABLED == TRUE) && \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)
  #define STM32_RTC_FREQ                    STM32_HSEDIV_FREQ
#else
  #define STM32_RTC_FREQ                    0U
#endif

/*--- Macros and checks for the USART1 clock point. ------------------------*/

/**
 * @brief   USART1 clock register bits.
 */
#if (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_PCLK2) || defined(__DOXYGEN__)
  #define STM32_USART1_BITS                 RCC_CCIPR_USART1SEL_PCLK2
#elif (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_SYSCLK)
  #define STM32_USART1_BITS                 RCC_CCIPR_USART1SEL_SYSCLK
#elif (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_HSI16)
  #define STM32_USART1_BITS                 RCC_CCIPR_USART1SEL_HSI16
#elif (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_LSE)
  #define STM32_USART1_BITS                 RCC_CCIPR_USART1SEL_LSE
#else
  #error "invalid STM32_CFG_USART1_SEL value specified"
#endif

/**
 * @brief   USART1 clock point.
 */
#if ((STM32_USART1_ENABLED == TRUE) && \
     (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_PCLK2)) || \
    defined(__DOXYGEN__)
  #define STM32_USART1_FREQ                 STM32_PCLK2_FREQ
#elif (STM32_USART1_ENABLED == TRUE) && \
      (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_SYSCLK)
  #define STM32_USART1_FREQ                 STM32_SYSCLK_FREQ
#elif (STM32_USART1_ENABLED == TRUE) && \
      (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_HSI16)
  #define STM32_USART1_FREQ                 STM32_HSI16_FREQ
#elif (STM32_USART1_ENABLED == TRUE) && \
      (STM32_CFG_USART1_SEL == RCC_CCIPR_USART1SEL_LSE)
  #define STM32_USART1_FREQ                 STM32_LSE_FREQ
#else
  #define STM32_USART1_FREQ                 0U
#endif

/*--- Macros and checks for the USART2 clock point. ------------------------*/

/**
 * @brief   USART2 clock register bits.
 */
#if (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_USART2_BITS                 RCC_CCIPR_USART2SEL_PCLK1
#elif (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_SYSCLK)
  #define STM32_USART2_BITS                 RCC_CCIPR_USART2SEL_SYSCLK
#elif (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_HSI16)
  #define STM32_USART2_BITS                 RCC_CCIPR_USART2SEL_HSI16
#elif (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_LSE)
  #define STM32_USART2_BITS                 RCC_CCIPR_USART2SEL_LSE
#else
  #error "invalid STM32_CFG_USART2_SEL value specified"
#endif

/**
 * @brief   USART2 clock point.
 */
#if ((STM32_USART2_ENABLED == TRUE) && \
     (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_USART2_FREQ                 STM32_PCLK1_FREQ
#elif (STM32_USART2_ENABLED == TRUE) && \
      (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_SYSCLK)
  #define STM32_USART2_FREQ                 STM32_SYSCLK_FREQ
#elif (STM32_USART2_ENABLED == TRUE) && \
      (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_HSI16)
  #define STM32_USART2_FREQ                 STM32_HSI16_FREQ
#elif (STM32_USART2_ENABLED == TRUE) && \
      (STM32_CFG_USART2_SEL == RCC_CCIPR_USART2SEL_LSE)
  #define STM32_USART2_FREQ                 STM32_LSE_FREQ
#else
  #define STM32_USART2_FREQ                 0U
#endif

