qmk/ChibiOS/os/hal/ports/STM32/STM32G4xx_TEST/clocktree.h
/*--- Macros and checks for the USART3 clock point. ------------------------*/

/**
 * @brief   USART3 clock register bits.
 */
#if (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_USART3_BITS                 RCC_CCIPR_USART3SEL_PCLK1
#elif (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_SYSCLK)
  #define STM32_USART3_BITS                 RCC_CCIPR_USART3SEL_SYSCLK
#elif (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_HSI16)
  #define STM32_USART3_BITS                 RCC_CCIPR_USART3SEL_HSI16
#elif (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_LSE)
  #define STM32_USART3_BITS                 RCC_CCIPR_USART3SEL_LSE
#else
  #error "invalid STM32_CFG_USART3_SEL value specified"
#endif

/**
 * @brief   USART3 clock point.
 */
#if ((STM32_USART3_ENABLED == TRUE) && \
     (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_USART3_FREQ                 STM32_PCLK1_FREQ
#elif (STM32_USART3_ENABLED == TRUE) && \
      (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_SYSCLK)
  #define STM32_USART3_FREQ                 STM32_SYSCLK_FREQ
#elif (STM32_USART3_ENABLED == TRUE) && \
      (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_HSI16)
  #define STM32_USART3_FREQ                 STM32_HSI16_FREQ
#elif (STM32_USART3_ENABLED == TRUE) && \
      (STM32_CFG_USART3_SEL == RCC_CCIPR_USART3SEL_LSE)
  #define STM32_USART3_FREQ                 STM32_LSE_FREQ
#else
  #define STM32_USART3_FREQ                 0U
#endif

/*--- Macros and checks for the UART4 clock point. -------------------------*/

/**
 * @brief   UART4 clock register bits.
 */
#if (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART4_BITS                  RCC_CCIPR_UART4SEL_PCLK1
#elif (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_SYSCLK)
  #define STM32_UART4_BITS                  RCC_CCIPR_UART4SEL_SYSCLK
#elif (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_HSI16)
  #define STM32_UART4_BITS                  RCC_CCIPR_UART4SEL_HSI16
#elif (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_LSE)
  #define STM32_UART4_BITS                  RCC_CCIPR_UART4SEL_LSE
#else
  #error "invalid STM32_CFG_UART4_SEL value specified"
#endif

/**
 * @brief   UART4 clock point.
 */
#if ((STM32_UART4_ENABLED == TRUE) && \
     (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_UART4_FREQ                  STM32_PCLK1_FREQ
#elif (STM32_UART4_ENABLED == TRUE) && \
      (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_SYSCLK)
  #define STM32_UART4_FREQ                  STM32_SYSCLK_FREQ
#elif (STM32_UART4_ENABLED == TRUE) && \
      (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_HSI16)
  #define STM32_UART4_FREQ                  STM32_HSI16_FREQ
#elif (STM32_UART4_ENABLED == TRUE) && \
      (STM32_CFG_UART4_SEL == RCC_CCIPR_UART4SEL_LSE)
  #define STM32_UART4_FREQ                  STM32_LSE_FREQ
#else
  #define STM32_UART4_FREQ                  0U
#endif

/*--- Macros and checks for the UART5 clock point. -------------------------*/

/**
 * @brief   UART5 clock register bits.
 */
#if (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART5_BITS                  RCC_CCIPR_UART5SEL_PCLK1
#elif (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_SYSCLK)
  #define STM32_UART5_BITS                  RCC_CCIPR_UART5SEL_SYSCLK
#elif (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_HSI16)
  #define STM32_UART5_BITS                  RCC_CCIPR_UART5SEL_HSI16
#elif (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_LSE)
  #define STM32_UART5_BITS                  RCC_CCIPR_UART5SEL_LSE
#else
  #error "invalid STM32_CFG_UART5_SEL value specified"
#endif

/**
 * @brief   UART5 clock point.
 */
#if ((STM32_UART5_ENABLED == TRUE) && \
     (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_UART5_FREQ                  STM32_PCLK1_FREQ
#elif (STM32_UART5_ENABLED == TRUE) && \
      (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_SYSCLK)
  #define STM32_UART5_FREQ                  STM32_SYSCLK_FREQ
#elif (STM32_UART5_ENABLED == TRUE) && \
      (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_HSI16)
  #define STM32_UART5_FREQ                  STM32_HSI16_FREQ
#elif (STM32_UART5_ENABLED == TRUE) && \
      (STM32_CFG_UART5_SEL == RCC_CCIPR_UART5SEL_LSE)
  #define STM32_UART5_FREQ                  STM32_LSE_FREQ
#else
  #define STM32_UART5_FREQ                  0U
#endif

/*--- Macros and checks for the LPUART1 clock point. -----------------------*/

/**
 * @brief   LPUART1 clock register bits.
 */
#if (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_PCLK1) ||                \
    defined(__DOXYGEN__)
  #define STM32_LPUART1_BITS                RCC_CCIPR_LPUART1SEL_PCLK1
#elif (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_SYSCLK)
  #define STM32_LPUART1_BITS                RCC_CCIPR_LPUART1SEL_SYSCLK
#elif (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_HSI16)
  #define STM32_LPUART1_BITS                RCC_CCIPR_LPUART1SEL_HSI16
#elif (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_LSE)
  #define STM32_LPUART1_BITS                RCC_CCIPR_LPUART1SEL_LSE
#else
  #error "invalid STM32_CFG_LPUART1_SEL value specified"
#endif

/**
 * @brief   LPUART1 clock point.
 */
#if ((STM32_LPUART1_ENABLED == TRUE) && \
     (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_LPUART1_FREQ                STM32_PCLK1_FREQ
#elif (STM32_LPUART1_ENABLED == TRUE) && \
      (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_SYSCLK)
  #define STM32_LPUART1_FREQ                STM32_SYSCLK_FREQ
#elif (STM32_LPUART1_ENABLED == TRUE) && \
      (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_HSI16)
  #define STM32_LPUART1_FREQ                STM32_HSI16_FREQ
#elif (STM32_LPUART1_ENABLED == TRUE) && \
      (STM32_CFG_LPUART1_SEL == RCC_CCIPR_LPUART1SEL_LSE)
  #define STM32_LPUART1_FREQ                STM32_LSE_FREQ
#else
  #define STM32_LPUART1_FREQ                0U
#endif

/*--- Macros and checks for the I2C1 clock point. --------------------------*/

/**
 * @brief   I2C1 clock register bits.
 */
#if (STM32_CFG_I2C1_SEL == RCC_CCIPR_I2C1SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C1_BITS                   RCC_CCIPR_I2C1SEL_PCLK1
#elif (STM32_CFG_I2C1_SEL == RCC_CCIPR_I2C1SEL_SYSCLK)
  #define STM32_I2C1_BITS                   RCC_CCIPR_I2C1SEL_SYSCLK
#elif (STM32_CFG_I2C1_SEL == RCC_CCIPR_I2C1SEL_HSI16)
  #define STM32_I2C1_BITS                   RCC_CCIPR_I2C1SEL_HSI16
#else
  #error "invalid STM32_CFG_I2C1_SEL value specified"
#endif

/**
 * @brief   I2C1 clock point.
 */
#if ((STM32_I2C1_ENABLED == TRUE) && \
     (STM32_CFG_I2C1_SEL == RCC_CCIPR_I2C1SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C1_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_I2C1_ENABLED == TRUE) && \
      (STM32_CFG_I2C1_SEL == RCC_CCIPR_I2C1SEL_SYSCLK)
  #define STM32_I2C1_FREQ                   STM32_SYSCLK_FREQ
#elif (STM32_I2C1_ENABLED == TRUE) && \
      (STM32_CFG_I2C1_SEL == RCC_CCIPR_I2C1SEL_HSI16)
  #define STM32_I2C1_FREQ                   STM32_HSI16_FREQ
#else
  #define STM32_I2C1_FREQ                   0U
#endif

