qmk/ChibiOS/os/hal/ports/STM32/STM32G4xx_TEST/clocktree.h
/*--- Macros and checks for the I2C2 clock point. --------------------------*/

/**
 * @brief   I2C2 clock register bits.
 */
#if (STM32_CFG_I2C2_SEL == RCC_CCIPR_I2C2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C2_BITS                   RCC_CCIPR_I2C2SEL_PCLK1
#elif (STM32_CFG_I2C2_SEL == RCC_CCIPR_I2C2SEL_SYSCLK)
  #define STM32_I2C2_BITS                   RCC_CCIPR_I2C2SEL_SYSCLK
#elif (STM32_CFG_I2C2_SEL == RCC_CCIPR_I2C2SEL_HSI16)
  #define STM32_I2C2_BITS                   RCC_CCIPR_I2C2SEL_HSI16
#else
  #error "invalid STM32_CFG_I2C2_SEL value specified"
#endif

/**
 * @brief   I2C2 clock point.
 */
#if ((STM32_I2C2_ENABLED == TRUE) && \
     (STM32_CFG_I2C2_SEL == RCC_CCIPR_I2C2SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C2_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_I2C2_ENABLED == TRUE) && \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR_I2C2SEL_SYSCLK)
  #define STM32_I2C2_FREQ                   STM32_SYSCLK_FREQ
#elif (STM32_I2C2_ENABLED == TRUE) && \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR_I2C2SEL_HSI16)
  #define STM32_I2C2_FREQ                   STM32_HSI16_FREQ
#else
  #define STM32_I2C2_FREQ                   0U
#endif

/*--- Macros and checks for the I2C3 clock point. --------------------------*/

/**
 * @brief   I2C3 clock register bits.
 */
#if (STM32_CFG_I2C3_SEL == RCC_CCIPR_I2C3SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C3_BITS                   RCC_CCIPR_I2C3SEL_PCLK1
#elif (STM32_CFG_I2C3_SEL == RCC_CCIPR_I2C3SEL_SYSCLK)
  #define STM32_I2C3_BITS                   RCC_CCIPR_I2C3SEL_SYSCLK
#elif (STM32_CFG_I2C3_SEL == RCC_CCIPR_I2C3SEL_HSI16)
  #define STM32_I2C3_BITS                   RCC_CCIPR_I2C3SEL_HSI16
#else
  #error "invalid STM32_CFG_I2C3_SEL value specified"
#endif

/**
 * @brief   I2C3 clock point.
 */
#if ((STM32_I2C3_ENABLED == TRUE) && \
     (STM32_CFG_I2C3_SEL == RCC_CCIPR_I2C3SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C3_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_I2C3_ENABLED == TRUE) && \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR_I2C3SEL_SYSCLK)
  #define STM32_I2C3_FREQ                   STM32_SYSCLK_FREQ
#elif (STM32_I2C3_ENABLED == TRUE) && \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR_I2C3SEL_HSI16)
  #define STM32_I2C3_FREQ                   STM32_HSI16_FREQ
#else
  #define STM32_I2C3_FREQ                   0U
#endif

/*--- Macros and checks for the I2C4 clock point. --------------------------*/

/**
 * @brief   I2C4 clock register bits.
 */
#if (STM32_CFG_I2C4_SEL == RCC_CCIPR2_I2C4SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C4_BITS                   RCC_CCIPR2_I2C4SEL_PCLK1
#elif (STM32_CFG_I2C4_SEL == RCC_CCIPR2_I2C4SEL_SYSCLK)
  #define STM32_I2C4_BITS                   RCC_CCIPR2_I2C4SEL_SYSCLK
#elif (STM32_CFG_I2C4_SEL == RCC_CCIPR2_I2C4SEL_HSI16)
  #define STM32_I2C4_BITS                   RCC_CCIPR2_I2C4SEL_HSI16
#else
  #error "invalid STM32_CFG_I2C4_SEL value specified"
#endif

/**
 * @brief   I2C4 clock point.
 */
#if ((STM32_I2C4_ENABLED == TRUE) && \
     (STM32_CFG_I2C4_SEL == RCC_CCIPR2_I2C4SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C4_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_I2C4_ENABLED == TRUE) && \
      (STM32_CFG_I2C4_SEL == RCC_CCIPR2_I2C4SEL_SYSCLK)
  #define STM32_I2C4_FREQ                   STM32_SYSCLK_FREQ
#elif (STM32_I2C4_ENABLED == TRUE) && \
      (STM32_CFG_I2C4_SEL == RCC_CCIPR2_I2C4SEL_HSI16)
  #define STM32_I2C4_FREQ                   STM32_HSI16_FREQ
#else
  #define STM32_I2C4_FREQ                   0U
#endif

/*--- Macros and checks for the LPTIM1 clock point. ------------------------*/

/**
 * @brief   LPTIM1 clock register bits.
 */
#if (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_LPTIM1_BITS                 RCC_CCIPR_LPTIM1SEL_PCLK1
#elif (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_LSI)
  #define STM32_LPTIM1_BITS                 RCC_CCIPR_LPTIM1SEL_LSI
#elif (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_HSI16)
  #define STM32_LPTIM1_BITS                 RCC_CCIPR_LPTIM1SEL_HSI16
#elif (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_LSE)
  #define STM32_LPTIM1_BITS                 RCC_CCIPR_LPTIM1SEL_LSE
#else
  #error "invalid STM32_CFG_LPTIM1_SEL value specified"
#endif

/**
 * @brief   LPTIM1 clock point.
 */
#if ((STM32_LPTIM1_ENABLED == TRUE) && \
     (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_LPTIM1_FREQ                 STM32_PCLK1_FREQ
#elif (STM32_LPTIM1_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_LSI)
  #define STM32_LPTIM1_FREQ                 STM32_LSI_FREQ
#elif (STM32_LPTIM1_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_HSI16)
  #define STM32_LPTIM1_FREQ                 STM32_HSI16_FREQ
#elif (STM32_LPTIM1_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR_LPTIM1SEL_LSE)
  #define STM32_LPTIM1_FREQ                 STM32_LSE_FREQ
#else
  #define STM32_LPTIM1_FREQ                 0U
#endif

/*--- Macros and checks for the SAI1 clock point. --------------------------*/

/**
 * @brief   SAI1 clock register bits.
 */
#if (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_SAI1_BITS                   RCC_CCIPR_SAI1SEL_SYSCLK
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_PLLQCLK)
  #define STM32_SAI1_BITS                   RCC_CCIPR_SAI1SEL_PLLQCLK
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_CKIN)
  #define STM32_SAI1_BITS                   RCC_CCIPR_SAI1SEL_CKIN
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_HSI16)
  #define STM32_SAI1_BITS                   RCC_CCIPR_SAI1SEL_HSI16
#else
  #error "invalid STM32_CFG_SAI1_SEL value specified"
#endif

/**
 * @brief   SAI1 clock point.
 */
#if ((STM32_SAI1_ENABLED == TRUE) && \
     (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_SAI1_FREQ                   STM32_SYSCLK_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_PLLQCLK)
  #define STM32_SAI1_FREQ                   STM32_PLLQ_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_CKIN)
  #define STM32_SAI1_FREQ                   STM32_CKIN_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR_SAI1SEL_HSI16)
  #define STM32_SAI1_FREQ                   STM32_HSI16_FREQ
#else
  #define STM32_SAI1_FREQ                   0U
#endif

