qmk/ChibiOS/os/hal/ports/STM32/STM32G4xx_TEST/clocktree.h
/*--- Macros and checks for the I2S23 clock point. -------------------------*/

/**
 * @brief   I2S23 clock register bits.
 */
#if (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_I2S23_BITS                  RCC_CCIPR_I2S23SEL_SYSCLK
#elif (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_PLLQCLK)
  #define STM32_I2S23_BITS                  RCC_CCIPR_I2S23SEL_PLLQCLK
#elif (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_CKIN)
  #define STM32_I2S23_BITS                  RCC_CCIPR_I2S23SEL_CKIN
#elif (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_HSI16)
  #define STM32_I2S23_BITS                  RCC_CCIPR_I2S23SEL_HSI16
#else
  #error "invalid STM32_CFG_I2S23_SEL value specified"
#endif

/**
 * @brief   I2S23 clock point.
 */
#if ((STM32_I2S23_ENABLED == TRUE) && \
     (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_I2S23_FREQ                  STM32_SYSCLK_FREQ
#elif (STM32_I2S23_ENABLED == TRUE) && \
      (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_PLLQCLK)
  #define STM32_I2S23_FREQ                  STM32_PLLQ_FREQ
#elif (STM32_I2S23_ENABLED == TRUE) && \
      (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_CKIN)
  #define STM32_I2S23_FREQ                  STM32_CKIN_FREQ
#elif (STM32_I2S23_ENABLED == TRUE) && \
      (STM32_CFG_I2S23_SEL == RCC_CCIPR_I2S23SEL_HSI16)
  #define STM32_I2S23_FREQ                  STM32_HSI16_FREQ
#else
  #define STM32_I2S23_FREQ                  0U
#endif

/*--- Macros and checks for the FDCAN clock point. -------------------------*/

/**
 * @brief   FDCAN clock register bits.
 */
#if (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_HSE) || defined(__DOXYGEN__)
  #define STM32_FDCAN_BITS                  RCC_CCIPR_FDCANSEL_HSE
#elif (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_PLLQCLK)
  #define STM32_FDCAN_BITS                  RCC_CCIPR_FDCANSEL_PLLQCLK
#elif (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_PCLK1)
  #define STM32_FDCAN_BITS                  RCC_CCIPR_FDCANSEL_PCLK1
#else
  #error "invalid STM32_CFG_FDCAN_SEL value specified"
#endif

/**
 * @brief   FDCAN clock point.
 */
#if ((STM32_FDCAN_ENABLED == TRUE) && \
     (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_HSE)) || \
    defined(__DOXYGEN__)
  #define STM32_FDCAN_FREQ                  STM32_HSE_FREQ
#elif (STM32_FDCAN_ENABLED == TRUE) && \
      (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_PLLQCLK)
  #define STM32_FDCAN_FREQ                  STM32_PLLQ_FREQ
#elif (STM32_FDCAN_ENABLED == TRUE) && \
      (STM32_CFG_FDCAN_SEL == RCC_CCIPR_FDCANSEL_PCLK1)
  #define STM32_FDCAN_FREQ                  STM32_PCLK1_FREQ
#else
  #define STM32_FDCAN_FREQ                  0U
#endif

/*--- Macros and checks for the CLK48 clock point. -------------------------*/

/**
 * @brief   CLK48 clock register bits.
 */
#if (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_HSI48) || defined(__DOXYGEN__)
  #define STM32_CLK48_BITS                  RCC_CCIPR_CLK48SEL_HSI48
#elif (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_PLLQCLK)
  #define STM32_CLK48_BITS                  RCC_CCIPR_CLK48SEL_PLLQCLK
#else
  #error "invalid STM32_CFG_CLK48_SEL value specified"
#endif

/**
 * @brief   48MHz clock point.
 */
#if ((STM32_CLK48_ENABLED == TRUE) && \
     (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_HSI48)) || \
    defined(__DOXYGEN__)
  #define STM32_CLK48_FREQ                  STM32_HSI48_FREQ
#elif (STM32_CLK48_ENABLED == TRUE) && \
      (STM32_CFG_CLK48_SEL == RCC_CCIPR_CLK48SEL_PLLQCLK)
  #define STM32_CLK48_FREQ                  STM32_PLLQ_FREQ
#else
  #define STM32_CLK48_FREQ                  0U
#endif

/*--- Macros and checks for the ADC12 clock point. -------------------------*/

/**
 * @brief   ADC12 clock register bits.
 */
#if (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_NOCLK) || defined(__DOXYGEN__)
  #define STM32_ADC12_BITS                  RCC_CCIPR_ADC12SEL_NOCLK
#elif (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_PLLPCLK)
  #define STM32_ADC12_BITS                  RCC_CCIPR_ADC12SEL_PLLPCLK
#elif (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_SYSCLK)
  #define STM32_ADC12_BITS                  RCC_CCIPR_ADC12SEL_SYSCLK
#else
  #error "invalid STM32_CFG_ADC12_SEL value specified"
#endif

/**
 * @brief   ADC12 clock point.
 */
#if ((STM32_ADC12_ENABLED == TRUE) && \
     (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_NOCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADC12_FREQ                  STM32_NONE_FREQ
#elif (STM32_ADC12_ENABLED == TRUE) && \
      (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_PLLPCLK)
  #define STM32_ADC12_FREQ                  STM32_PLLP_FREQ
#elif (STM32_ADC12_ENABLED == TRUE) && \
      (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_SYSCLK)
  #define STM32_ADC12_FREQ                  STM32_SYSCLK_FREQ
#else
  #define STM32_ADC12_FREQ                  0U
#endif

#if !(!((STM32_ADC12_ENABLED == TRUE) &&                                    \
      (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_PLLPCLK)) ||               \
     (STM32_PLLP_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADC12_FREQ above maximum frequency"
#endif

#if !(!((STM32_ADC12_ENABLED == TRUE) &&                                    \
      (STM32_CFG_ADC12_SEL == RCC_CCIPR_ADC12SEL_SYSCLK)) ||                \
     (STM32_SYSCLK_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADC12_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the ADC345 clock point. ------------------------*/

/**
 * @brief   ADC345 clock register bits.
 */
#if (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_NOCLK) || defined(__DOXYGEN__)
  #define STM32_ADC345_BITS                 RCC_CCIPR_ADC345SEL_NOCLK
#elif (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_PLLPCLK)
  #define STM32_ADC345_BITS                 RCC_CCIPR_ADC345SEL_PLLPCLK
#elif (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_SYSCLK)
  #define STM32_ADC345_BITS                 RCC_CCIPR_ADC345SEL_SYSCLK
#else
  #error "invalid STM32_CFG_ADC345_SEL value specified"
#endif

/**
 * @brief   ADC345 clock point.
 */
#if ((STM32_ADC345_ENABLED == TRUE) && \
     (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_NOCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADC345_FREQ                 STM32_NONE_FREQ
#elif (STM32_ADC345_ENABLED == TRUE) && \
      (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_PLLPCLK)
  #define STM32_ADC345_FREQ                 STM32_PLLP_FREQ
#elif (STM32_ADC345_ENABLED == TRUE) && \
      (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_SYSCLK)
  #define STM32_ADC345_FREQ                 STM32_SYSCLK_FREQ
#else
  #define STM32_ADC345_FREQ                 0U
#endif

#if !(!((STM32_ADC345_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_PLLPCLK)) ||             \
     (STM32_PLLP_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADC345_FREQ above maximum frequency"
#endif

#if !(!((STM32_ADC345_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADC345_SEL == RCC_CCIPR_ADC345SEL_SYSCLK)) ||              \
     (STM32_SYSCLK_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADC345_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the QSPI clock point. --------------------------*/

/**
 * @brief   QSPI clock register bits.
 */
#if (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_QSPI_BITS                   RCC_CCIPR2_QSPISEL_SYSCLK
#elif (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_HSI16)
  #define STM32_QSPI_BITS                   RCC_CCIPR2_QSPISEL_HSI16
#elif (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_PLLQCLK)
  #define STM32_QSPI_BITS                   RCC_CCIPR2_QSPISEL_PLLQCLK
#else
  #error "invalid STM32_CFG_QSPI_SEL value specified"
#endif

/**
 * @brief   QSPI clock point.
 */
#if ((STM32_QSPI_ENABLED == TRUE) && \
     (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_QSPI_FREQ                   STM32_SYSCLK_FREQ
#elif (STM32_QSPI_ENABLED == TRUE) && \
      (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_HSI16)
  #define STM32_QSPI_FREQ                   STM32_HSI16_FREQ
#elif (STM32_QSPI_ENABLED == TRUE) && \
      (STM32_CFG_QSPI_SEL == RCC_CCIPR2_QSPISEL_PLLQCLK)
  #define STM32_QSPI_FREQ                   STM32_PLLQ_FREQ
#else
  #define STM32_QSPI_FREQ                   0U
#endif

/*--- Macros and checks for the RNG clock point. ---------------------------*/

/**
 * @brief   RNG clock register bits.
 */
#define STM32_RNG_BITS                      0U

/**
 * @brief   RNG clock point.
 */
#define STM32_RNG_FREQ                      STM32_CLK48_FREQ

/*--- Macros and checks for the USB clock point. ---------------------------*/

/**
 * @brief   USB clock register bits.
 */
#define STM32_USB_BITS                      0U

/**
 * @brief   USB clock point.
 */
#define STM32_USB_FREQ                      STM32_CLK48_FREQ
/** @} */

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @name    Current clock point values
 * @{
 */
#define STM32_NONE_CLOCK                    STM32_NONE_FREQ
#define STM32_HSI16_CLOCK                   hal_lld_get_clock_point(CLK_HSI16)
#define STM32_HSI48_CLOCK                   hal_lld_get_clock_point(CLK_HSI48)
#define STM32_HSE_CLOCK                     hal_lld_get_clock_point(CLK_HSE)
#define STM32_LSE_CLOCK                     STM32_LSE_FREQ
#define STM32_LSI_CLOCK                     STM32_LSI_FREQ
#define STM32_CKIN_CLOCK                    STM32_CKIN_FREQ
#define STM32_PLLIN_CLOCK                   STM32_PLLIN_FREQ
#define STM32_PLLREF_CLOCK                  STM32_PLLREF_FREQ
#define STM32_PLLVCO_CLOCK                  STM32_PLLVCO_FREQ
#define STM32_PLLP_CLOCK                    hal_lld_get_clock_point(CLK_PLLP)
#define STM32_PLLQ_CLOCK                    hal_lld_get_clock_point(CLK_PLLQ)
#define STM32_PLLR_CLOCK                    hal_lld_get_clock_point(CLK_PLLR)
#define STM32_SYSCLK_CLOCK                  hal_lld_get_clock_point(CLK_SYSCLK)
#define STM32_HCLK_CLOCK                    hal_lld_get_clock_point(CLK_HCLK)
#define STM32_PCLK1_CLOCK                   hal_lld_get_clock_point(CLK_PCLK1)
#define STM32_PCLK2_CLOCK                   hal_lld_get_clock_point(CLK_PCLK2)
#define STM32_PCLK1TIM_CLOCK                hal_lld_get_clock_point(CLK_PCLK1TIM)
#define STM32_PCLK2TIM_CLOCK                hal_lld_get_clock_point(CLK_PCLK2TIM)
#define STM32_HSEDIV_CLOCK                  STM32_HSEDIV_FREQ
#define STM32_MCODIV_CLOCK                  STM32_MCODIV_FREQ
#define STM32_MCO_CLOCK                     hal_lld_get_clock_point(CLK_MCO)
#define STM32_LSCO_CLOCK                    STM32_LSCO_FREQ
#define STM32_RTC_CLOCK                     STM32_RTC_FREQ
#define STM32_USART1_CLOCK                  STM32_USART1_FREQ
#define STM32_USART2_CLOCK                  STM32_USART2_FREQ
#define STM32_USART3_CLOCK                  STM32_USART3_FREQ
#define STM32_UART4_CLOCK                   STM32_UART4_FREQ
#define STM32_UART5_CLOCK                   STM32_UART5_FREQ
#define STM32_LPUART1_CLOCK                 STM32_LPUART1_FREQ
#define STM32_I2C1_CLOCK                    STM32_I2C1_FREQ
#define STM32_I2C2_CLOCK                    STM32_I2C2_FREQ
#define STM32_I2C3_CLOCK                    STM32_I2C3_FREQ
#define STM32_I2C4_CLOCK                    STM32_I2C4_FREQ
#define STM32_LPTIM1_CLOCK                  STM32_LPTIM1_FREQ
#define STM32_SAI1_CLOCK                    STM32_SAI1_FREQ
#define STM32_I2S23_CLOCK                   STM32_I2S23_FREQ
#define STM32_FDCAN_CLOCK                   STM32_FDCAN_FREQ
#define STM32_CLK48_CLOCK                   STM32_CLK48_FREQ
#define STM32_ADC12_CLOCK                   STM32_ADC12_FREQ
#define STM32_ADC345_CLOCK                  STM32_ADC345_FREQ
#define STM32_QSPI_CLOCK                    STM32_QSPI_FREQ
#define STM32_RNG_CLOCK                     STM32_RNG_FREQ
#define STM32_USB_CLOCK                     STM32_USB_FREQ
/** @} */

/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
#if (STM32_CFG_CLOCK_DYNAMIC == FALSE) || defined(__DOXYGEN__)
#define hal_lld_get_clock_point(clkpt)                                      \
  ((clkpt) == CLK_HSI16        ? STM32_HSI16_FREQ         :                 \
   (clkpt) == CLK_HSI48        ? STM32_HSI48_FREQ         :                 \
   (clkpt) == CLK_HSE          ? STM32_HSE_FREQ           :                 \
   (clkpt) == CLK_PLLP         ? STM32_PLLP_FREQ          :                 \
   (clkpt) == CLK_PLLQ         ? STM32_PLLQ_FREQ          :                 \
   (clkpt) == CLK_PLLR         ? STM32_PLLR_FREQ          :                 \
   (clkpt) == CLK_SYSCLK       ? STM32_SYSCLK_FREQ        :                 \
   (clkpt) == CLK_HCLK         ? STM32_HCLK_FREQ          :                 \
   (clkpt) == CLK_PCLK1        ? STM32_PCLK1_FREQ         :                 \
   (clkpt) == CLK_PCLK2        ? STM32_PCLK2_FREQ         :                 \
   (clkpt) == CLK_PCLK1TIM     ? STM32_PCLK1TIM_FREQ      :                 \
   (clkpt) == CLK_PCLK2TIM     ? STM32_PCLK2TIM_FREQ      :                 \
   (clkpt) == CLK_MCO          ? STM32_MCO_FREQ           :                 \
   0U)
#endif

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif
#ifdef __cplusplus
}
#endif

#endif /* CLOCKTREE_H */

/** @} */
